Old Simulations/engineSimOne/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 3538.04;
boundaryField
{
    freestream
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 3538.04;
    }
    walls
    {
        type            zeroGradient;
    }
    bottomEmptyFaces
    {
        type            empty;
    }
    topEmptyFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
