Old Simulations/engineSimOne/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                |
| \      /  F ield         | cfMesh: A library for mesh generation          |
|  \    /   O peration     |                                                |
|   \  /    A nd           | Author: Franjo Juretic                         |
|    \/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-10;
        relTol          0.0;
    }

    e
    {
        $U;
        tolerance       1e-10;
        relTol          0.0;
    }
    relaxationFactors
    {
    equations
    {
          rho      0.15;
          rhoU     0.15;
      rhoE     0.15;
    }
    }
    "(k|epsilon).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }
}

// ************************************************************************* //